Repository: ItellaPlugins/itella-cod-woocommerce
Catalog: languages/itella-cod-*.po
Languages: lt_lt

source: Card on delivery
lt_lt: Kortele pristatant

source: Card on delivery payment method for Smartpost Itella shipping
lt_lt: Apmokėjimo kortele pristatymo metu metodas skirtas Smartpost Itella pristatymui

source: Disable
lt_lt: Išjungti

source: Disable extra fee if cart amount is greater or equal than this limit.
lt_lt: Krepšelio suma, nuo kurios išjungiamas papildomas mokestis.

source: Disabled
lt_lt: Išjungtas

source: Enable
lt_lt: Įjungti

source: Enable card on delivery
lt_lt: Įjunkite išperkamąjį mokestį.

source: Enable for specific countries
lt_lt: Pasirinkite šalis, kur galimas šis atsiskaitymo būdas

source: Enter Amount
lt_lt: Įveskite sumą

source: Extra Fee
lt_lt: Papildomas mokestis

source: Extra Fee Amount
lt_lt: Papildomo mokesčio dydis

source: Extra Fee Tax
lt_lt: Papildomo mokesčio apmokestinimas

source: Fixed
lt_lt: Fiksuotas

source: here
lt_lt: čia

source: https://itella.lt/en/
lt_lt: https://itella.lt/lt/

source: Is extra fee taxable? Use this option if you have taxes enabled in your shop and you want to include tax to COD method.
lt_lt: Ar papildomas mokestis apmokestinamas? Pasirinkite šią opciją, jei savo parduotuvėje esate įjungę mokesčius ir norite juos įtraukti išperkamojo mokesčio (COD) būdui.

source: Itella Team
lt_lt: Itella komanda

source: Leave blank or zero if you want to charge for any amount
lt_lt: Palikite tuščią arba įrašykite nulį, jei norite visada taikyti papildomą mokestį

source: Pay with card upon delivery.
lt_lt: Mokėkite kortele pristatymo metu.

source: Percentage
lt_lt: Procentinis dydis

source: Please enable at least one country
lt_lt: Pasirinkite bent vieną šalį

source: Please enable at least one shipping method
lt_lt: Pasirinkite bent vieną siuntimo būdą

source: Select Countries
lt_lt: Pasirinkite šalis

source: Select countries you want to enable the Itella COD method
lt_lt: Pasirinkite šalis, kur galimas Itella išperkamojo mokesčio atsiskaitymo būdas

source: Select Extra fee type
lt_lt: Pasirinkite papildomo mokesčio tipą

source: Select Itella COD methods.
lt_lt: Pasirinkite Itella siuntimo būdus

source: Setup Itella COD
lt_lt: Sukonfigūruokite Itella išperkamąjį mokestį (COD)

source: Setup Smartpost Itella's Card on Delivery.
lt_lt: Smartpost Itella apmokėjimo kortele pristatymo metu nustatymai.

source: Smartpost Itella Card on Delivery
lt_lt: Smartpost Itella išperkamasis mokestis (COD)

source: Smartpost Itella COD
lt_lt: Smartpost Itella išperkamasis mokestis (COD)

source: The extra amount you charging for card on delivery (leave blank or zero if you don't charge extra)
lt_lt: Papildoma suma už išperkamąjį mokestį (palikite tuščią arba įrašykite nulį, jei neketinate imti papildomo mokesčio)
